app/controllers/home_controller.rb

SELECT * FROM `produtos` WHERE (`produtos`.`promocao` = 1) ORDER BY Rand() LIMIT 9
SELECT `imagems`.* FROM `imagems` WHERE (`imagems`.produto_id IN (1,3,2,4))
---
  def index
    @produtos = Produto.find(:all,
                             :conditions => { :promocao => true },
                             :order => 'RAND()',
                             :limit => 9)

    @images = Imagem.find(:all, :conditions => [ 'produto_id in (?)', @produtos.collect(&:id) ])