app/controllers/imagems_controller.rb

SELECT * FROM `imagems`
---
  def index
    @imagems = Imagem.all

SELECT * FROM `imagems` WHERE (`imagems`.`id` = 1)
---
  def show
    @imagem = Imagem.find(params[:id])

SELECT * FROM `imagems` WHERE (`imagems`.`id` = 3)
---
  def edit
    @imagem = Imagem.find(params[:id])

SELECT * FROM `produtos` WHERE (`produtos`.`id` = 1)
INSERT INTO `imagems` (`produto_id`, `created_at`, `titulo`, `updated_at`, `caminho`) VALUES(1, '2011-02-11 01:00:54', 'meu titulo', '2011-02-11 01:00:54', '')
---
  def create

    @imagem = Imagem.new()
    @imagem.titulo = params[:imagem][:titulo]
    @imagem.produto = Produto.find(params[:imagem][:produto_id])
    @imagem.caminho = params[:imagem][:caminho]

    respond_to do |format|
      #if Imagem.save_file(params[:imagem]) and @imagem.save
      if @imagem.save

SELECT * FROM `imagems` WHERE (`imagems`.`id` = 3)
---
  def update
    @imagem = Imagem.find(params[:id])

SELECT * FROM `imagems` WHERE (`imagems`.`id` = 1)
DELETE FROM `imagems` WHERE `id` = 1
---
  def destroy
    @imagem = Imagem.find(params[:id])
    @imagem.destroy