app/controllers/produtos_controller.rb

SELECT * FROM `categorias` WHERE (`categorias`.`id` = 1)
SELECT `produtos`.* FROM `produtos` INNER JOIN `sub_categorias` ON `sub_categorias`.id = `produtos`.sub_categoria_id INNER JOIN `categorias` ON `categorias`.id = `produtos`.categoria_id WHERE ( categorias.nome LIKE '%%' AND sub_categorias.nome LIKE '%%') LIMIT 0, 5
---
  def index
    logger.debug "Solicitando INDEX"

    if params[:pagina] && params[:pagina].to_i > 0
      @pagina = params[:pagina]
    else
      @pagina = 1
    end
    logger.debug "@pagina = " + @pagina.to_s


    @selSubCat = (params[:subcategorias]) ? params[:subcategorias] : 'pagina'
    @selCat = (params[:categorias]) ? params[:categorias] : 'pagina'

    logger.debug "@selectedSubCat = " + @selSubCat.to_s
    logger.debug "@selectedCat = " + @selCat.to_s

    @produtos = Produto.find(:all,
                             :joins => [:sub_categoria, :categoria],
                             :conditions => [
                                              ' categorias.nome LIKE ? AND sub_categorias.nome LIKE ?',
                                              '%'+params[:categorias].to_s+'%', '%'+params[:subcategorias].to_s+'%'
                                            ],
                             :offset => ((@pagina.to_i - 1) * 5),
                             :limit => 5
                            )

SELECT * FROM `sub_categorias`
---
    @totPag = 1 if @totPag == 0


    @categorias = Categoria.all

SELECT * FROM `produtos` WHERE (`produtos`.`id` = 1)
---
  def show
    id = params[:id]

    if id.to_i > 0
      @produto = Produto.find(id)

SELECT * FROM `produtos` WHERE (`produtos`.`id` = 1)
---
  def edit
    @produto = Produto.find(params[:id])

INSERT INTO `produtos` (`created_at`, `nome`, `titulo`, `updated_at`, `promocao`, `preco`, `linkFabricante`, `modelo`, `descricao`, `categoria_id`, `marca`, `sub_categoria_id`) VALUES('2011-02-10 23:55:16', 'Balanca talz', 'sdfsfds', '2011-02-10 23:55:16', 0, 200, NULL, '', 'sdfsdfsd', NULL, 'sdfsd', NULL)
---
  def create
    @produto = Produto.new(params[:produto])
    @produto.descricao_filename = @produto.save_file(params[:produto])

SELECT * FROM `produtos` WHERE (`produtos`.`id` = 1)
---
  def ger
    @produtos = Produto.find(:all)