app/controllers/usuarios_controller.rb

SELECT * FROM `usuarios`
---
  def index
    @usuarios = Usuario.all

SELECT * FROM `usuarios` WHERE (`usuarios`.`login` = 'adm' AND `usuarios`.`senha` = '123')
---
  def authenticate
    if request.post?
      @usuario = Usuario.find_all_by_login_and_senha(params[:usuario][:login], params[:usuario][:senha]).first